MikroElektronika/core_packages/PIC/XC8/def/PIC16F913/mcu.h
extern volatile IOCbits_t IOCbits __at(0x096);
// bitfield macros
#define _IOC_IOCB_POSN                                      0x4
#define _IOC_IOCB_POSITION                                  0x4
#define _IOC_IOCB_SIZE                                      0x4
#define _IOC_IOCB_LENGTH                                    0x4
#define _IOC_IOCB_MASK                                      0xF0
#define _IOC_IOCB4_POSN                                     0x4
#define _IOC_IOCB4_POSITION                                 0x4
#define _IOC_IOCB4_SIZE                                     0x1
#define _IOC_IOCB4_LENGTH                                   0x1
#define _IOC_IOCB4_MASK                                     0x10
#define _IOC_IOCB5_POSN                                     0x5
#define _IOC_IOCB5_POSITION                                 0x5
#define _IOC_IOCB5_SIZE                                     0x1
#define _IOC_IOCB5_LENGTH                                   0x1
#define _IOC_IOCB5_MASK                                     0x20
#define _IOC_IOCB6_POSN                                     0x6
#define _IOC_IOCB6_POSITION                                 0x6
#define _IOC_IOCB6_SIZE                                     0x1
#define _IOC_IOCB6_LENGTH                                   0x1
#define _IOC_IOCB6_MASK                                     0x40
#define _IOC_IOCB7_POSN                                     0x7
#define _IOC_IOCB7_POSITION                                 0x7
#define _IOC_IOCB7_SIZE                                     0x1
#define _IOC_IOCB7_LENGTH                                   0x1
#define _IOC_IOCB7_MASK                                     0x80
#define _IOC_IOC4_POSN                                      0x4
#define _IOC_IOC4_POSITION                                  0x4
#define _IOC_IOC4_SIZE                                      0x1
#define _IOC_IOC4_LENGTH                                    0x1
#define _IOC_IOC4_MASK                                      0x10
#define _IOC_IOC5_POSN                                      0x5
#define _IOC_IOC5_POSITION                                  0x5
#define _IOC_IOC5_SIZE                                      0x1
#define _IOC_IOC5_LENGTH                                    0x1
#define _IOC_IOC5_MASK                                      0x20
#define _IOC_IOC6_POSN                                      0x6
#define _IOC_IOC6_POSITION                                  0x6
#define _IOC_IOC6_SIZE                                      0x1
#define _IOC_IOC6_LENGTH                                    0x1
#define _IOC_IOC6_MASK                                      0x40
#define _IOC_IOC7_POSN                                      0x7
#define _IOC_IOC7_POSITION                                  0x7
#define _IOC_IOC7_SIZE                                      0x1
#define _IOC_IOC7_LENGTH                                    0x1
#define _IOC_IOC7_MASK                                      0x80

// Register: CMCON1
#define CMCON1 CMCON1
extern volatile unsigned char           CMCON1              __at(0x097);
#ifndef _LIB_BUILD
asm("CMCON1 equ 097h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C2SYNC                 :1;
        unsigned T1GSS                  :1;
    };
} CMCON1bits_t;
extern volatile CMCON1bits_t CMCON1bits __at(0x097);
// bitfield macros
#define _CMCON1_C2SYNC_POSN                                 0x0
#define _CMCON1_C2SYNC_POSITION                             0x0
#define _CMCON1_C2SYNC_SIZE                                 0x1
#define _CMCON1_C2SYNC_LENGTH                               0x1
#define _CMCON1_C2SYNC_MASK                                 0x1
#define _CMCON1_T1GSS_POSN                                  0x1
#define _CMCON1_T1GSS_POSITION                              0x1
#define _CMCON1_T1GSS_SIZE                                  0x1
#define _CMCON1_T1GSS_LENGTH                                0x1
#define _CMCON1_T1GSS_MASK                                  0x2

// Register: TXSTA
#define TXSTA TXSTA
extern volatile unsigned char           TXSTA               __at(0x098);
#ifndef _LIB_BUILD
asm("TXSTA equ 098h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TX9D                   :1;
        unsigned TRMT                   :1;
        unsigned BRGH                   :1;
        unsigned                        :1;
        unsigned SYNC                   :1;
        unsigned TXEN                   :1;
        unsigned TX9                    :1;
        unsigned CSRC                   :1;
    };
    struct {
        unsigned TXD8                   :1;
        unsigned                        :5;
        unsigned nTX8                   :1;
    };
    struct {
        unsigned                        :6;
        unsigned TX8_9                  :1;
    };
} TXSTAbits_t;
extern volatile TXSTAbits_t TXSTAbits __at(0x098);
// bitfield macros
#define _TXSTA_TX9D_POSN                                    0x0
#define _TXSTA_TX9D_POSITION                                0x0
#define _TXSTA_TX9D_SIZE                                    0x1
#define _TXSTA_TX9D_LENGTH                                  0x1
#define _TXSTA_TX9D_MASK                                    0x1
#define _TXSTA_TRMT_POSN                                    0x1
#define _TXSTA_TRMT_POSITION                                0x1
#define _TXSTA_TRMT_SIZE                                    0x1
#define _TXSTA_TRMT_LENGTH                                  0x1
#define _TXSTA_TRMT_MASK                                    0x2
#define _TXSTA_BRGH_POSN                                    0x2
#define _TXSTA_BRGH_POSITION                                0x2
#define _TXSTA_BRGH_SIZE                                    0x1
#define _TXSTA_BRGH_LENGTH                                  0x1
#define _TXSTA_BRGH_MASK                                    0x4
#define _TXSTA_SYNC_POSN                                    0x4
#define _TXSTA_SYNC_POSITION                                0x4
#define _TXSTA_SYNC_SIZE                                    0x1
#define _TXSTA_SYNC_LENGTH                                  0x1
#define _TXSTA_SYNC_MASK                                    0x10
#define _TXSTA_TXEN_POSN                                    0x5
#define _TXSTA_TXEN_POSITION                                0x5
#define _TXSTA_TXEN_SIZE                                    0x1
#define _TXSTA_TXEN_LENGTH                                  0x1
#define _TXSTA_TXEN_MASK                                    0x20
#define _TXSTA_TX9_POSN                                     0x6
#define _TXSTA_TX9_POSITION                                 0x6
#define _TXSTA_TX9_SIZE                                     0x1
#define _TXSTA_TX9_LENGTH                                   0x1
#define _TXSTA_TX9_MASK                                     0x40
#define _TXSTA_CSRC_POSN                                    0x7
#define _TXSTA_CSRC_POSITION                                0x7
#define _TXSTA_CSRC_SIZE                                    0x1
#define _TXSTA_CSRC_LENGTH                                  0x1
#define _TXSTA_CSRC_MASK                                    0x80
#define _TXSTA_TXD8_POSN                                    0x0
#define _TXSTA_TXD8_POSITION                                0x0
#define _TXSTA_TXD8_SIZE                                    0x1
#define _TXSTA_TXD8_LENGTH                                  0x1
#define _TXSTA_TXD8_MASK                                    0x1
#define _TXSTA_nTX8_POSN                                    0x6
#define _TXSTA_nTX8_POSITION                                0x6
#define _TXSTA_nTX8_SIZE                                    0x1
#define _TXSTA_nTX8_LENGTH                                  0x1
#define _TXSTA_nTX8_MASK                                    0x40
#define _TXSTA_TX8_9_POSN                                   0x6
#define _TXSTA_TX8_9_POSITION                               0x6
#define _TXSTA_TX8_9_SIZE                                   0x1
#define _TXSTA_TX8_9_LENGTH                                 0x1
#define _TXSTA_TX8_9_MASK                                   0x40

// Register: SPBRG
#define SPBRG SPBRG
extern volatile unsigned char           SPBRG               __at(0x099);
#ifndef _LIB_BUILD
asm("SPBRG equ 099h");
#endif

// Register: CMCON0
#define CMCON0 CMCON0
extern volatile unsigned char           CMCON0              __at(0x09C);
#ifndef _LIB_BUILD
asm("CMCON0 equ 09Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CM                     :3;
        unsigned CIS                    :1;
        unsigned C1INV                  :1;
        unsigned C2INV                  :1;
        unsigned C1OUT                  :1;
        unsigned C2OUT                  :1;
    };
    struct {
        unsigned CM0                    :1;
        unsigned CM1                    :1;
        unsigned CM2                    :1;
    };
} CMCON0bits_t;
