MikroElektronika/core_packages/PIC/XC8/def/PIC16F913/mcu.h
// Register: LCDDATA6
#define LCDDATA6 LCDDATA6
extern volatile unsigned char           LCDDATA6            __at(0x116);
#ifndef _LIB_BUILD
asm("LCDDATA6 equ 0116h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG0                   :1;
        unsigned SEG1                   :1;
        unsigned SEG2                   :1;
        unsigned SEG3                   :1;
        unsigned SEG4                   :1;
        unsigned SEG5                   :1;
        unsigned SEG6                   :1;
        unsigned SEG7                   :1;
    };
    struct {
        unsigned SEG0COM2               :1;
        unsigned SEG1COM2               :1;
        unsigned SEG2COM2               :1;
        unsigned SEG3COM2               :1;
        unsigned SEG4COM2               :1;
        unsigned SEG5COM2               :1;
        unsigned SEG6COM2               :1;
        unsigned SEG7COM2               :1;
    };
    struct {
        unsigned S0C2                   :1;
        unsigned S1C2                   :1;
        unsigned S2C2                   :1;
        unsigned S3C2                   :1;
        unsigned S4C2                   :1;
        unsigned S5C2                   :1;
        unsigned S6C2                   :1;
        unsigned S7C2                   :1;
    };
} LCDDATA6bits_t;
extern volatile LCDDATA6bits_t LCDDATA6bits __at(0x116);
// bitfield macros
#define _LCDDATA6_SEG0_POSN                                 0x0
#define _LCDDATA6_SEG0_POSITION                             0x0
#define _LCDDATA6_SEG0_SIZE                                 0x1
#define _LCDDATA6_SEG0_LENGTH                               0x1
#define _LCDDATA6_SEG0_MASK                                 0x1
#define _LCDDATA6_SEG1_POSN                                 0x1
#define _LCDDATA6_SEG1_POSITION                             0x1
#define _LCDDATA6_SEG1_SIZE                                 0x1
#define _LCDDATA6_SEG1_LENGTH                               0x1
#define _LCDDATA6_SEG1_MASK                                 0x2
#define _LCDDATA6_SEG2_POSN                                 0x2
#define _LCDDATA6_SEG2_POSITION                             0x2
#define _LCDDATA6_SEG2_SIZE                                 0x1
#define _LCDDATA6_SEG2_LENGTH                               0x1
#define _LCDDATA6_SEG2_MASK                                 0x4
#define _LCDDATA6_SEG3_POSN                                 0x3
#define _LCDDATA6_SEG3_POSITION                             0x3
#define _LCDDATA6_SEG3_SIZE                                 0x1
#define _LCDDATA6_SEG3_LENGTH                               0x1
#define _LCDDATA6_SEG3_MASK                                 0x8
#define _LCDDATA6_SEG4_POSN                                 0x4
#define _LCDDATA6_SEG4_POSITION                             0x4
#define _LCDDATA6_SEG4_SIZE                                 0x1
#define _LCDDATA6_SEG4_LENGTH                               0x1
#define _LCDDATA6_SEG4_MASK                                 0x10
#define _LCDDATA6_SEG5_POSN                                 0x5
#define _LCDDATA6_SEG5_POSITION                             0x5
#define _LCDDATA6_SEG5_SIZE                                 0x1
#define _LCDDATA6_SEG5_LENGTH                               0x1
#define _LCDDATA6_SEG5_MASK                                 0x20
#define _LCDDATA6_SEG6_POSN                                 0x6
#define _LCDDATA6_SEG6_POSITION                             0x6
#define _LCDDATA6_SEG6_SIZE                                 0x1
#define _LCDDATA6_SEG6_LENGTH                               0x1
#define _LCDDATA6_SEG6_MASK                                 0x40
#define _LCDDATA6_SEG7_POSN                                 0x7
#define _LCDDATA6_SEG7_POSITION                             0x7
#define _LCDDATA6_SEG7_SIZE                                 0x1
#define _LCDDATA6_SEG7_LENGTH                               0x1
#define _LCDDATA6_SEG7_MASK                                 0x80
#define _LCDDATA6_SEG0COM2_POSN                             0x0
#define _LCDDATA6_SEG0COM2_POSITION                         0x0
#define _LCDDATA6_SEG0COM2_SIZE                             0x1
#define _LCDDATA6_SEG0COM2_LENGTH                           0x1
#define _LCDDATA6_SEG0COM2_MASK                             0x1
#define _LCDDATA6_SEG1COM2_POSN                             0x1
#define _LCDDATA6_SEG1COM2_POSITION                         0x1
#define _LCDDATA6_SEG1COM2_SIZE                             0x1
#define _LCDDATA6_SEG1COM2_LENGTH                           0x1
#define _LCDDATA6_SEG1COM2_MASK                             0x2
#define _LCDDATA6_SEG2COM2_POSN                             0x2
#define _LCDDATA6_SEG2COM2_POSITION                         0x2
#define _LCDDATA6_SEG2COM2_SIZE                             0x1
#define _LCDDATA6_SEG2COM2_LENGTH                           0x1
#define _LCDDATA6_SEG2COM2_MASK                             0x4
#define _LCDDATA6_SEG3COM2_POSN                             0x3
#define _LCDDATA6_SEG3COM2_POSITION                         0x3
#define _LCDDATA6_SEG3COM2_SIZE                             0x1
#define _LCDDATA6_SEG3COM2_LENGTH                           0x1
#define _LCDDATA6_SEG3COM2_MASK                             0x8
#define _LCDDATA6_SEG4COM2_POSN                             0x4
#define _LCDDATA6_SEG4COM2_POSITION                         0x4
#define _LCDDATA6_SEG4COM2_SIZE                             0x1
#define _LCDDATA6_SEG4COM2_LENGTH                           0x1
#define _LCDDATA6_SEG4COM2_MASK                             0x10
#define _LCDDATA6_SEG5COM2_POSN                             0x5
#define _LCDDATA6_SEG5COM2_POSITION                         0x5
#define _LCDDATA6_SEG5COM2_SIZE                             0x1
#define _LCDDATA6_SEG5COM2_LENGTH                           0x1
#define _LCDDATA6_SEG5COM2_MASK                             0x20
#define _LCDDATA6_SEG6COM2_POSN                             0x6
#define _LCDDATA6_SEG6COM2_POSITION                         0x6
#define _LCDDATA6_SEG6COM2_SIZE                             0x1
#define _LCDDATA6_SEG6COM2_LENGTH                           0x1
#define _LCDDATA6_SEG6COM2_MASK                             0x40
#define _LCDDATA6_SEG7COM2_POSN                             0x7
#define _LCDDATA6_SEG7COM2_POSITION                         0x7
#define _LCDDATA6_SEG7COM2_SIZE                             0x1
#define _LCDDATA6_SEG7COM2_LENGTH                           0x1
#define _LCDDATA6_SEG7COM2_MASK                             0x80
#define _LCDDATA6_S0C2_POSN                                 0x0
#define _LCDDATA6_S0C2_POSITION                             0x0
#define _LCDDATA6_S0C2_SIZE                                 0x1
#define _LCDDATA6_S0C2_LENGTH                               0x1
#define _LCDDATA6_S0C2_MASK                                 0x1
#define _LCDDATA6_S1C2_POSN                                 0x1
#define _LCDDATA6_S1C2_POSITION                             0x1
#define _LCDDATA6_S1C2_SIZE                                 0x1
#define _LCDDATA6_S1C2_LENGTH                               0x1
#define _LCDDATA6_S1C2_MASK                                 0x2
#define _LCDDATA6_S2C2_POSN                                 0x2
#define _LCDDATA6_S2C2_POSITION                             0x2
#define _LCDDATA6_S2C2_SIZE                                 0x1
#define _LCDDATA6_S2C2_LENGTH                               0x1
#define _LCDDATA6_S2C2_MASK                                 0x4
#define _LCDDATA6_S3C2_POSN                                 0x3
#define _LCDDATA6_S3C2_POSITION                             0x3
#define _LCDDATA6_S3C2_SIZE                                 0x1
#define _LCDDATA6_S3C2_LENGTH                               0x1
#define _LCDDATA6_S3C2_MASK                                 0x8
#define _LCDDATA6_S4C2_POSN                                 0x4
#define _LCDDATA6_S4C2_POSITION                             0x4
#define _LCDDATA6_S4C2_SIZE                                 0x1
#define _LCDDATA6_S4C2_LENGTH                               0x1
#define _LCDDATA6_S4C2_MASK                                 0x10
#define _LCDDATA6_S5C2_POSN                                 0x5
#define _LCDDATA6_S5C2_POSITION                             0x5
#define _LCDDATA6_S5C2_SIZE                                 0x1
#define _LCDDATA6_S5C2_LENGTH                               0x1
#define _LCDDATA6_S5C2_MASK                                 0x20
#define _LCDDATA6_S6C2_POSN                                 0x6
#define _LCDDATA6_S6C2_POSITION                             0x6
#define _LCDDATA6_S6C2_SIZE                                 0x1
#define _LCDDATA6_S6C2_LENGTH                               0x1
#define _LCDDATA6_S6C2_MASK                                 0x40
#define _LCDDATA6_S7C2_POSN                                 0x7
#define _LCDDATA6_S7C2_POSITION                             0x7
#define _LCDDATA6_S7C2_SIZE                                 0x1
#define _LCDDATA6_S7C2_LENGTH                               0x1
#define _LCDDATA6_S7C2_MASK                                 0x80

// Register: LCDDATA7
#define LCDDATA7 LCDDATA7
extern volatile unsigned char           LCDDATA7            __at(0x117);
#ifndef _LIB_BUILD
asm("LCDDATA7 equ 0117h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG8                   :1;
        unsigned SEG9                   :1;
        unsigned SEG10                  :1;
        unsigned SEG11                  :1;
        unsigned SEG12                  :1;
        unsigned SEG13                  :1;
        unsigned SEG14                  :1;
        unsigned SEG15                  :1;
    };
    struct {
        unsigned SEG8COM2               :1;
        unsigned SEG9COM2               :1;
        unsigned SEG10COM2              :1;
        unsigned SEG11COM2              :1;
        unsigned SEG12COM2              :1;
        unsigned SEG13COM2              :1;
        unsigned SEG14COM2              :1;
        unsigned SEG15COM2              :1;
    };
    struct {
        unsigned S8C2                   :1;
        unsigned S9C2                   :1;
        unsigned S10C2                  :1;
        unsigned S11C2                  :1;
        unsigned S12C2                  :1;
        unsigned S13C2                  :1;
        unsigned S14C2                  :1;
        unsigned S15C2                  :1;
    };
} LCDDATA7bits_t;
extern volatile LCDDATA7bits_t LCDDATA7bits __at(0x117);
// bitfield macros
#define _LCDDATA7_SEG8_POSN                                 0x0
#define _LCDDATA7_SEG8_POSITION                             0x0
#define _LCDDATA7_SEG8_SIZE                                 0x1
#define _LCDDATA7_SEG8_LENGTH                               0x1
#define _LCDDATA7_SEG8_MASK                                 0x1
#define _LCDDATA7_SEG9_POSN                                 0x1
#define _LCDDATA7_SEG9_POSITION                             0x1
#define _LCDDATA7_SEG9_SIZE                                 0x1
#define _LCDDATA7_SEG9_LENGTH                               0x1
#define _LCDDATA7_SEG9_MASK                                 0x2
#define _LCDDATA7_SEG10_POSN                                0x2
#define _LCDDATA7_SEG10_POSITION                            0x2
#define _LCDDATA7_SEG10_SIZE                                0x1
#define _LCDDATA7_SEG10_LENGTH                              0x1
#define _LCDDATA7_SEG10_MASK                                0x4
#define _LCDDATA7_SEG11_POSN                                0x3
#define _LCDDATA7_SEG11_POSITION                            0x3
#define _LCDDATA7_SEG11_SIZE                                0x1
#define _LCDDATA7_SEG11_LENGTH                              0x1
#define _LCDDATA7_SEG11_MASK                                0x8
#define _LCDDATA7_SEG12_POSN                                0x4
#define _LCDDATA7_SEG12_POSITION                            0x4
#define _LCDDATA7_SEG12_SIZE                                0x1
#define _LCDDATA7_SEG12_LENGTH                              0x1
#define _LCDDATA7_SEG12_MASK                                0x10
#define _LCDDATA7_SEG13_POSN                                0x5
#define _LCDDATA7_SEG13_POSITION                            0x5
#define _LCDDATA7_SEG13_SIZE                                0x1
#define _LCDDATA7_SEG13_LENGTH                              0x1
#define _LCDDATA7_SEG13_MASK                                0x20
#define _LCDDATA7_SEG14_POSN                                0x6
#define _LCDDATA7_SEG14_POSITION                            0x6
#define _LCDDATA7_SEG14_SIZE                                0x1
#define _LCDDATA7_SEG14_LENGTH                              0x1
#define _LCDDATA7_SEG14_MASK                                0x40
#define _LCDDATA7_SEG15_POSN                                0x7
#define _LCDDATA7_SEG15_POSITION                            0x7
#define _LCDDATA7_SEG15_SIZE                                0x1
#define _LCDDATA7_SEG15_LENGTH                              0x1
#define _LCDDATA7_SEG15_MASK                                0x80
#define _LCDDATA7_SEG8COM2_POSN                             0x0
#define _LCDDATA7_SEG8COM2_POSITION                         0x0
#define _LCDDATA7_SEG8COM2_SIZE                             0x1
#define _LCDDATA7_SEG8COM2_LENGTH                           0x1
#define _LCDDATA7_SEG8COM2_MASK                             0x1
#define _LCDDATA7_SEG9COM2_POSN                             0x1
#define _LCDDATA7_SEG9COM2_POSITION                         0x1
#define _LCDDATA7_SEG9COM2_SIZE                             0x1
#define _LCDDATA7_SEG9COM2_LENGTH                           0x1
#define _LCDDATA7_SEG9COM2_MASK                             0x2
#define _LCDDATA7_SEG10COM2_POSN                            0x2
#define _LCDDATA7_SEG10COM2_POSITION                        0x2
#define _LCDDATA7_SEG10COM2_SIZE                            0x1
#define _LCDDATA7_SEG10COM2_LENGTH                          0x1
#define _LCDDATA7_SEG10COM2_MASK                            0x4
#define _LCDDATA7_SEG11COM2_POSN                            0x3
#define _LCDDATA7_SEG11COM2_POSITION                        0x3
#define _LCDDATA7_SEG11COM2_SIZE                            0x1
#define _LCDDATA7_SEG11COM2_LENGTH                          0x1
#define _LCDDATA7_SEG11COM2_MASK                            0x8
#define _LCDDATA7_SEG12COM2_POSN                            0x4
#define _LCDDATA7_SEG12COM2_POSITION                        0x4
#define _LCDDATA7_SEG12COM2_SIZE                            0x1
#define _LCDDATA7_SEG12COM2_LENGTH                          0x1
#define _LCDDATA7_SEG12COM2_MASK                            0x10
#define _LCDDATA7_SEG13COM2_POSN                            0x5
#define _LCDDATA7_SEG13COM2_POSITION                        0x5
#define _LCDDATA7_SEG13COM2_SIZE                            0x1
#define _LCDDATA7_SEG13COM2_LENGTH                          0x1
#define _LCDDATA7_SEG13COM2_MASK                            0x20
#define _LCDDATA7_SEG14COM2_POSN                            0x6
#define _LCDDATA7_SEG14COM2_POSITION                        0x6
#define _LCDDATA7_SEG14COM2_SIZE                            0x1
#define _LCDDATA7_SEG14COM2_LENGTH                          0x1
#define _LCDDATA7_SEG14COM2_MASK                            0x40
#define _LCDDATA7_SEG15COM2_POSN                            0x7
#define _LCDDATA7_SEG15COM2_POSITION                        0x7
#define _LCDDATA7_SEG15COM2_SIZE                            0x1
#define _LCDDATA7_SEG15COM2_LENGTH                          0x1
#define _LCDDATA7_SEG15COM2_MASK                            0x80
#define _LCDDATA7_S8C2_POSN                                 0x0
#define _LCDDATA7_S8C2_POSITION                             0x0
#define _LCDDATA7_S8C2_SIZE                                 0x1
#define _LCDDATA7_S8C2_LENGTH                               0x1
#define _LCDDATA7_S8C2_MASK                                 0x1
#define _LCDDATA7_S9C2_POSN                                 0x1
#define _LCDDATA7_S9C2_POSITION                             0x1
#define _LCDDATA7_S9C2_SIZE                                 0x1
#define _LCDDATA7_S9C2_LENGTH                               0x1
#define _LCDDATA7_S9C2_MASK                                 0x2
#define _LCDDATA7_S10C2_POSN                                0x2
#define _LCDDATA7_S10C2_POSITION                            0x2
#define _LCDDATA7_S10C2_SIZE                                0x1
#define _LCDDATA7_S10C2_LENGTH                              0x1
#define _LCDDATA7_S10C2_MASK                                0x4
#define _LCDDATA7_S11C2_POSN                                0x3
#define _LCDDATA7_S11C2_POSITION                            0x3
#define _LCDDATA7_S11C2_SIZE                                0x1
#define _LCDDATA7_S11C2_LENGTH                              0x1
#define _LCDDATA7_S11C2_MASK                                0x8
#define _LCDDATA7_S12C2_POSN                                0x4
#define _LCDDATA7_S12C2_POSITION                            0x4
#define _LCDDATA7_S12C2_SIZE                                0x1
#define _LCDDATA7_S12C2_LENGTH                              0x1
#define _LCDDATA7_S12C2_MASK                                0x10
#define _LCDDATA7_S13C2_POSN                                0x5
#define _LCDDATA7_S13C2_POSITION                            0x5
#define _LCDDATA7_S13C2_SIZE                                0x1
#define _LCDDATA7_S13C2_LENGTH                              0x1
#define _LCDDATA7_S13C2_MASK                                0x20
#define _LCDDATA7_S14C2_POSN                                0x6
#define _LCDDATA7_S14C2_POSITION                            0x6
#define _LCDDATA7_S14C2_SIZE                                0x1
#define _LCDDATA7_S14C2_LENGTH                              0x1
#define _LCDDATA7_S14C2_MASK                                0x40
#define _LCDDATA7_S15C2_POSN                                0x7
#define _LCDDATA7_S15C2_POSITION                            0x7
#define _LCDDATA7_S15C2_SIZE                                0x1
#define _LCDDATA7_S15C2_LENGTH                              0x1
#define _LCDDATA7_S15C2_MASK                                0x80

// Register: LCDDATA9
#define LCDDATA9 LCDDATA9
extern volatile unsigned char           LCDDATA9            __at(0x119);
#ifndef _LIB_BUILD
asm("LCDDATA9 equ 0119h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG0                   :1;
        unsigned SEG1                   :1;
        unsigned SEG2                   :1;
        unsigned SEG3                   :1;
        unsigned SEG4                   :1;
        unsigned SEG5                   :1;
        unsigned SEG6                   :1;
        unsigned SEG7                   :1;
    };
    struct {
        unsigned SEG0COM3               :1;
        unsigned SEG1COM3               :1;
        unsigned SEG2COM3               :1;
        unsigned SEG3COM3               :1;
        unsigned SEG4COM3               :1;
        unsigned SEG5COM3               :1;
        unsigned SEG6COM3               :1;
        unsigned SEG7COM3               :1;
    };
    struct {
        unsigned S0C3                   :1;
        unsigned S1C3                   :1;
        unsigned S2C3                   :1;
        unsigned S3C3                   :1;
        unsigned S4C3                   :1;
        unsigned S5C3                   :1;
        unsigned S6C3                   :1;
        unsigned S7C3                   :1;
    };
} LCDDATA9bits_t;
