MikroElektronika/core_packages/PIC/XC8/def/PIC16F913/mcu.h
extern volatile LCDSE1bits_t LCDSE1bits __at(0x11D);
// bitfield macros
#define _LCDSE1_SEG8_POSN                                   0x0
#define _LCDSE1_SEG8_POSITION                               0x0
#define _LCDSE1_SEG8_SIZE                                   0x1
#define _LCDSE1_SEG8_LENGTH                                 0x1
#define _LCDSE1_SEG8_MASK                                   0x1
#define _LCDSE1_SEG9_POSN                                   0x1
#define _LCDSE1_SEG9_POSITION                               0x1
#define _LCDSE1_SEG9_SIZE                                   0x1
#define _LCDSE1_SEG9_LENGTH                                 0x1
#define _LCDSE1_SEG9_MASK                                   0x2
#define _LCDSE1_SEG10_POSN                                  0x2
#define _LCDSE1_SEG10_POSITION                              0x2
#define _LCDSE1_SEG10_SIZE                                  0x1
#define _LCDSE1_SEG10_LENGTH                                0x1
#define _LCDSE1_SEG10_MASK                                  0x4
#define _LCDSE1_SEG11_POSN                                  0x3
#define _LCDSE1_SEG11_POSITION                              0x3
#define _LCDSE1_SEG11_SIZE                                  0x1
#define _LCDSE1_SEG11_LENGTH                                0x1
#define _LCDSE1_SEG11_MASK                                  0x8
#define _LCDSE1_SEG12_POSN                                  0x4
#define _LCDSE1_SEG12_POSITION                              0x4
#define _LCDSE1_SEG12_SIZE                                  0x1
#define _LCDSE1_SEG12_LENGTH                                0x1
#define _LCDSE1_SEG12_MASK                                  0x10
#define _LCDSE1_SEG13_POSN                                  0x5
#define _LCDSE1_SEG13_POSITION                              0x5
#define _LCDSE1_SEG13_SIZE                                  0x1
#define _LCDSE1_SEG13_LENGTH                                0x1
#define _LCDSE1_SEG13_MASK                                  0x20
#define _LCDSE1_SEG14_POSN                                  0x6
#define _LCDSE1_SEG14_POSITION                              0x6
#define _LCDSE1_SEG14_SIZE                                  0x1
#define _LCDSE1_SEG14_LENGTH                                0x1
#define _LCDSE1_SEG14_MASK                                  0x40
#define _LCDSE1_SEG15_POSN                                  0x7
#define _LCDSE1_SEG15_POSITION                              0x7
#define _LCDSE1_SEG15_SIZE                                  0x1
#define _LCDSE1_SEG15_LENGTH                                0x1
#define _LCDSE1_SEG15_MASK                                  0x80
#define _LCDSE1_SE8_POSN                                    0x0
#define _LCDSE1_SE8_POSITION                                0x0
#define _LCDSE1_SE8_SIZE                                    0x1
#define _LCDSE1_SE8_LENGTH                                  0x1
#define _LCDSE1_SE8_MASK                                    0x1
#define _LCDSE1_SE9_POSN                                    0x1
#define _LCDSE1_SE9_POSITION                                0x1
#define _LCDSE1_SE9_SIZE                                    0x1
#define _LCDSE1_SE9_LENGTH                                  0x1
#define _LCDSE1_SE9_MASK                                    0x2
#define _LCDSE1_SE10_POSN                                   0x2
#define _LCDSE1_SE10_POSITION                               0x2
#define _LCDSE1_SE10_SIZE                                   0x1
#define _LCDSE1_SE10_LENGTH                                 0x1
#define _LCDSE1_SE10_MASK                                   0x4
#define _LCDSE1_SE11_POSN                                   0x3
#define _LCDSE1_SE11_POSITION                               0x3
#define _LCDSE1_SE11_SIZE                                   0x1
#define _LCDSE1_SE11_LENGTH                                 0x1
#define _LCDSE1_SE11_MASK                                   0x8
#define _LCDSE1_SE12_POSN                                   0x4
#define _LCDSE1_SE12_POSITION                               0x4
#define _LCDSE1_SE12_SIZE                                   0x1
#define _LCDSE1_SE12_LENGTH                                 0x1
#define _LCDSE1_SE12_MASK                                   0x10
#define _LCDSE1_SE13_POSN                                   0x5
#define _LCDSE1_SE13_POSITION                               0x5
#define _LCDSE1_SE13_SIZE                                   0x1
#define _LCDSE1_SE13_LENGTH                                 0x1
#define _LCDSE1_SE13_MASK                                   0x20
#define _LCDSE1_SE14_POSN                                   0x6
#define _LCDSE1_SE14_POSITION                               0x6
#define _LCDSE1_SE14_SIZE                                   0x1
#define _LCDSE1_SE14_LENGTH                                 0x1
#define _LCDSE1_SE14_MASK                                   0x40
#define _LCDSE1_SE15_POSN                                   0x7
#define _LCDSE1_SE15_POSITION                               0x7
#define _LCDSE1_SE15_SIZE                                   0x1
#define _LCDSE1_SE15_LENGTH                                 0x1
#define _LCDSE1_SE15_MASK                                   0x80
#define _LCDSE1_SEGEN8_POSN                                 0x0
#define _LCDSE1_SEGEN8_POSITION                             0x0
#define _LCDSE1_SEGEN8_SIZE                                 0x1
#define _LCDSE1_SEGEN8_LENGTH                               0x1
#define _LCDSE1_SEGEN8_MASK                                 0x1
#define _LCDSE1_SEGEN9_POSN                                 0x1
#define _LCDSE1_SEGEN9_POSITION                             0x1
#define _LCDSE1_SEGEN9_SIZE                                 0x1
#define _LCDSE1_SEGEN9_LENGTH                               0x1
#define _LCDSE1_SEGEN9_MASK                                 0x2
#define _LCDSE1_SEGEN10_POSN                                0x2
#define _LCDSE1_SEGEN10_POSITION                            0x2
#define _LCDSE1_SEGEN10_SIZE                                0x1
#define _LCDSE1_SEGEN10_LENGTH                              0x1
#define _LCDSE1_SEGEN10_MASK                                0x4
#define _LCDSE1_SEGEN11_POSN                                0x3
#define _LCDSE1_SEGEN11_POSITION                            0x3
#define _LCDSE1_SEGEN11_SIZE                                0x1
#define _LCDSE1_SEGEN11_LENGTH                              0x1
#define _LCDSE1_SEGEN11_MASK                                0x8
#define _LCDSE1_SEGEN12_POSN                                0x4
#define _LCDSE1_SEGEN12_POSITION                            0x4
#define _LCDSE1_SEGEN12_SIZE                                0x1
#define _LCDSE1_SEGEN12_LENGTH                              0x1
#define _LCDSE1_SEGEN12_MASK                                0x10
#define _LCDSE1_SEGEN13_POSN                                0x5
#define _LCDSE1_SEGEN13_POSITION                            0x5
#define _LCDSE1_SEGEN13_SIZE                                0x1
#define _LCDSE1_SEGEN13_LENGTH                              0x1
#define _LCDSE1_SEGEN13_MASK                                0x20
#define _LCDSE1_SEGEN14_POSN                                0x6
#define _LCDSE1_SEGEN14_POSITION                            0x6
#define _LCDSE1_SEGEN14_SIZE                                0x1
#define _LCDSE1_SEGEN14_LENGTH                              0x1
#define _LCDSE1_SEGEN14_MASK                                0x40
#define _LCDSE1_SEGEN15_POSN                                0x7
#define _LCDSE1_SEGEN15_POSITION                            0x7
#define _LCDSE1_SEGEN15_SIZE                                0x1
#define _LCDSE1_SEGEN15_LENGTH                              0x1
#define _LCDSE1_SEGEN15_MASK                                0x80

// Register: EECON1
#define EECON1 EECON1
extern volatile unsigned char           EECON1              __at(0x18C);
#ifndef _LIB_BUILD
asm("EECON1 equ 018Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD                     :1;
        unsigned WR                     :1;
        unsigned WREN                   :1;
        unsigned WRERR                  :1;
        unsigned                        :3;
        unsigned EEPGD                  :1;
    };
    struct {
        unsigned EERD                   :1;
        unsigned EEWR                   :1;
    };
} EECON1bits_t;
extern volatile EECON1bits_t EECON1bits __at(0x18C);
// bitfield macros
#define _EECON1_RD_POSN                                     0x0
#define _EECON1_RD_POSITION                                 0x0
#define _EECON1_RD_SIZE                                     0x1
#define _EECON1_RD_LENGTH                                   0x1
#define _EECON1_RD_MASK                                     0x1
#define _EECON1_WR_POSN                                     0x1
#define _EECON1_WR_POSITION                                 0x1
#define _EECON1_WR_SIZE                                     0x1
#define _EECON1_WR_LENGTH                                   0x1
#define _EECON1_WR_MASK                                     0x2
#define _EECON1_WREN_POSN                                   0x2
#define _EECON1_WREN_POSITION                               0x2
#define _EECON1_WREN_SIZE                                   0x1
#define _EECON1_WREN_LENGTH                                 0x1
#define _EECON1_WREN_MASK                                   0x4
#define _EECON1_WRERR_POSN                                  0x3
#define _EECON1_WRERR_POSITION                              0x3
#define _EECON1_WRERR_SIZE                                  0x1
#define _EECON1_WRERR_LENGTH                                0x1
#define _EECON1_WRERR_MASK                                  0x8
#define _EECON1_EEPGD_POSN                                  0x7
#define _EECON1_EEPGD_POSITION                              0x7
#define _EECON1_EEPGD_SIZE                                  0x1
#define _EECON1_EEPGD_LENGTH                                0x1
#define _EECON1_EEPGD_MASK                                  0x80
#define _EECON1_EERD_POSN                                   0x0
#define _EECON1_EERD_POSITION                               0x0
#define _EECON1_EERD_SIZE                                   0x1
#define _EECON1_EERD_LENGTH                                 0x1
#define _EECON1_EERD_MASK                                   0x1
#define _EECON1_EEWR_POSN                                   0x1
#define _EECON1_EEWR_POSITION                               0x1
#define _EECON1_EEWR_SIZE                                   0x1
#define _EECON1_EEWR_LENGTH                                 0x1
#define _EECON1_EEWR_MASK                                   0x2

// Register: EECON2
#define EECON2 EECON2
extern volatile unsigned char           EECON2              __at(0x18D);
#ifndef _LIB_BUILD
asm("EECON2 equ 018Dh");
#endif

