MikroElektronika/core_packages/PIC/XC8/def/PIC16F913/mcu.h
// OSCCON<LTS>
extern volatile __bit                   LTS                 __at(0x479);	// @ (0x8F * 8 + 1)
#define                                 LTS_bit             _BIT_ACCESS(OSCCON,1)
// LVDCON<LVDEN>
extern volatile __bit                   LVDEN               __at(0x84C);	// @ (0x109 * 8 + 4)
#define                                 LVDEN_bit           _BIT_ACCESS(LVDCON,4)
// PIE2<LVDIE>
extern volatile __bit                   LVDIE               __at(0x46A);	// @ (0x8D * 8 + 2)
#define                                 LVDIE_bit           _BIT_ACCESS(PIE2,2)
// PIR2<LVDIF>
extern volatile __bit                   LVDIF               __at(0x6A);	// @ (0xD * 8 + 2)
#define                                 LVDIF_bit           _BIT_ACCESS(PIR2,2)
// LVDCON<LVDL0>
extern volatile __bit                   LVDL0               __at(0x848);	// @ (0x109 * 8 + 0)
#define                                 LVDL0_bit           _BIT_ACCESS(LVDCON,0)
// LVDCON<LVDL1>
extern volatile __bit                   LVDL1               __at(0x849);	// @ (0x109 * 8 + 1)
#define                                 LVDL1_bit           _BIT_ACCESS(LVDCON,1)
// LVDCON<LVDL2>
extern volatile __bit                   LVDL2               __at(0x84A);	// @ (0x109 * 8 + 2)
#define                                 LVDL2_bit           _BIT_ACCESS(LVDCON,2)
// RCSTA<OERR>
extern volatile __bit                   OERR                __at(0xC1);	// @ (0x18 * 8 + 1)
#define                                 OERR_bit            _BIT_ACCESS(RCSTA,1)
// PIE2<OSFIE>
extern volatile __bit                   OSFIE               __at(0x46F);	// @ (0x8D * 8 + 7)
#define                                 OSFIE_bit           _BIT_ACCESS(PIE2,7)
// PIR2<OSFIF>
extern volatile __bit                   OSFIF               __at(0x6F);	// @ (0xD * 8 + 7)
#define                                 OSFIF_bit           _BIT_ACCESS(PIR2,7)
// OSCCON<OSTS>
extern volatile __bit                   OSTS                __at(0x47B);	// @ (0x8F * 8 + 3)
#define                                 OSTS_bit            _BIT_ACCESS(OSCCON,3)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x5E);	// @ (0xB * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// OPTION_REG<PS0>
extern volatile __bit                   PS0                 __at(0x408);	// @ (0x81 * 8 + 0)
#define                                 PS0_bit             _BIT_ACCESS(OPTION_REG,0)
// OPTION_REG<PS1>
extern volatile __bit                   PS1                 __at(0x409);	// @ (0x81 * 8 + 1)
#define                                 PS1_bit             _BIT_ACCESS(OPTION_REG,1)
// OPTION_REG<PS2>
extern volatile __bit                   PS2                 __at(0x40A);	// @ (0x81 * 8 + 2)
#define                                 PS2_bit             _BIT_ACCESS(OPTION_REG,2)
// OPTION_REG<PSA>
extern volatile __bit                   PSA                 __at(0x40B);	// @ (0x81 * 8 + 3)
#define                                 PSA_bit             _BIT_ACCESS(OPTION_REG,3)
// PORTA<RA0>
extern volatile __bit                   RA0                 __at(0x28);	// @ (0x5 * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<RA1>
extern volatile __bit                   RA1                 __at(0x29);	// @ (0x5 * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(PORTA,1)
// PORTA<RA2>
extern volatile __bit                   RA2                 __at(0x2A);	// @ (0x5 * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<RA3>
extern volatile __bit                   RA3                 __at(0x2B);	// @ (0x5 * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<RA4>
extern volatile __bit                   RA4                 __at(0x2C);	// @ (0x5 * 8 + 4)
#define                                 RA4_bit             _BIT_ACCESS(PORTA,4)
// PORTA<RA5>
extern volatile __bit                   RA5                 __at(0x2D);	// @ (0x5 * 8 + 5)
#define                                 RA5_bit             _BIT_ACCESS(PORTA,5)
// PORTA<RA6>
extern volatile __bit                   RA6                 __at(0x2E);	// @ (0x5 * 8 + 6)
#define                                 RA6_bit             _BIT_ACCESS(PORTA,6)
// PORTA<RA7>
extern volatile __bit                   RA7                 __at(0x2F);	// @ (0x5 * 8 + 7)
#define                                 RA7_bit             _BIT_ACCESS(PORTA,7)
// PORTB<RB0>
extern volatile __bit                   RB0                 __at(0x30);	// @ (0x6 * 8 + 0)
#define                                 RB0_bit             _BIT_ACCESS(PORTB,0)
// PORTB<RB1>
extern volatile __bit                   RB1                 __at(0x31);	// @ (0x6 * 8 + 1)
#define                                 RB1_bit             _BIT_ACCESS(PORTB,1)
// PORTB<RB2>
extern volatile __bit                   RB2                 __at(0x32);	// @ (0x6 * 8 + 2)
#define                                 RB2_bit             _BIT_ACCESS(PORTB,2)
// PORTB<RB3>
extern volatile __bit                   RB3                 __at(0x33);	// @ (0x6 * 8 + 3)
#define                                 RB3_bit             _BIT_ACCESS(PORTB,3)
// PORTB<RB4>
extern volatile __bit                   RB4                 __at(0x34);	// @ (0x6 * 8 + 4)
#define                                 RB4_bit             _BIT_ACCESS(PORTB,4)
// PORTB<RB5>
extern volatile __bit                   RB5                 __at(0x35);	// @ (0x6 * 8 + 5)
#define                                 RB5_bit             _BIT_ACCESS(PORTB,5)
// PORTB<RB6>
extern volatile __bit                   RB6                 __at(0x36);	// @ (0x6 * 8 + 6)
#define                                 RB6_bit             _BIT_ACCESS(PORTB,6)
// PORTB<RB7>
extern volatile __bit                   RB7                 __at(0x37);	// @ (0x6 * 8 + 7)
#define                                 RB7_bit             _BIT_ACCESS(PORTB,7)
// INTCON<RBIE>
extern volatile __bit                   RBIE                __at(0x5B);	// @ (0xB * 8 + 3)
#define                                 RBIE_bit            _BIT_ACCESS(INTCON,3)
// INTCON<RBIF>
extern volatile __bit                   RBIF                __at(0x58);	// @ (0xB * 8 + 0)
#define                                 RBIF_bit            _BIT_ACCESS(INTCON,0)
// PORTC<RC0>
extern volatile __bit                   RC0                 __at(0x38);	// @ (0x7 * 8 + 0)
#define                                 RC0_bit             _BIT_ACCESS(PORTC,0)
// PORTC<RC1>
extern volatile __bit                   RC1                 __at(0x39);	// @ (0x7 * 8 + 1)
#define                                 RC1_bit             _BIT_ACCESS(PORTC,1)
// PORTC<RC2>
extern volatile __bit                   RC2                 __at(0x3A);	// @ (0x7 * 8 + 2)
#define                                 RC2_bit             _BIT_ACCESS(PORTC,2)
// PORTC<RC3>
extern volatile __bit                   RC3                 __at(0x3B);	// @ (0x7 * 8 + 3)
#define                                 RC3_bit             _BIT_ACCESS(PORTC,3)
// PORTC<RC4>
extern volatile __bit                   RC4                 __at(0x3C);	// @ (0x7 * 8 + 4)
#define                                 RC4_bit             _BIT_ACCESS(PORTC,4)
// PORTC<RC5>
extern volatile __bit                   RC5                 __at(0x3D);	// @ (0x7 * 8 + 5)
#define                                 RC5_bit             _BIT_ACCESS(PORTC,5)
// PORTC<RC6>
extern volatile __bit                   RC6                 __at(0x3E);	// @ (0x7 * 8 + 6)
#define                                 RC6_bit             _BIT_ACCESS(PORTC,6)
// PORTC<RC7>
extern volatile __bit                   RC7                 __at(0x3F);	// @ (0x7 * 8 + 7)
#define                                 RC7_bit             _BIT_ACCESS(PORTC,7)
// RCSTA<RC8_9>
extern volatile __bit                   RC8_9               __at(0xC6);	// @ (0x18 * 8 + 6)
#define                                 RC8_9_bit           _BIT_ACCESS(RCSTA,6)
// RCSTA<RC9>
extern volatile __bit                   RC9                 __at(0xC6);	// @ (0x18 * 8 + 6)
#define                                 RC9_bit             _BIT_ACCESS(RCSTA,6)
// RCSTA<RCD8>
extern volatile __bit                   RCD8                __at(0xC0);	// @ (0x18 * 8 + 0)
#define                                 RCD8_bit            _BIT_ACCESS(RCSTA,0)
// PIE1<RCIE>
extern volatile __bit                   RCIE                __at(0x465);	// @ (0x8C * 8 + 5)
#define                                 RCIE_bit            _BIT_ACCESS(PIE1,5)
// PIR1<RCIF>
extern volatile __bit                   RCIF                __at(0x65);	// @ (0xC * 8 + 5)
#define                                 RCIF_bit            _BIT_ACCESS(PIR1,5)
// EECON1<RD>
extern volatile __bit                   RD                  __at(0xC60);	// @ (0x18C * 8 + 0)
#define                                 RD_bit              _BIT_ACCESS(EECON1,0)
// PORTE<RE3>
extern volatile __bit                   RE3                 __at(0x4B);	// @ (0x9 * 8 + 3)
#define                                 RE3_bit             _BIT_ACCESS(PORTE,3)
// SSPSTAT<READ_WRITE>
extern volatile __bit                   READ_WRITE          __at(0x4A2);	// @ (0x94 * 8 + 2)
#define                                 READ_WRITE_bit      _BIT_ACCESS(SSPSTAT,2)
// STATUS<RP0>
extern volatile __bit                   RP0                 __at(0x1D);	// @ (0x3 * 8 + 5)
#define                                 RP0_bit             _BIT_ACCESS(STATUS,5)
// STATUS<RP1>
extern volatile __bit                   RP1                 __at(0x1E);	// @ (0x3 * 8 + 6)
#define                                 RP1_bit             _BIT_ACCESS(STATUS,6)
// RCSTA<RX9>
extern volatile __bit                   RX9                 __at(0xC6);	// @ (0x18 * 8 + 6)
#define                                 RX9_bit             _BIT_ACCESS(RCSTA,6)
// RCSTA<RX9D>
extern volatile __bit                   RX9D                __at(0xC0);	// @ (0x18 * 8 + 0)
#define                                 RX9D_bit            _BIT_ACCESS(RCSTA,0)
// SSPSTAT<R_W>
extern volatile __bit                   R_W                 __at(0x4A2);	// @ (0x94 * 8 + 2)
#define                                 R_W_bit             _BIT_ACCESS(SSPSTAT,2)
// SSPSTAT<R_nW>
extern volatile __bit                   R_nW                __at(0x4A2);	// @ (0x94 * 8 + 2)
#define                                 R_nW_bit            _BIT_ACCESS(SSPSTAT,2)
// LCDDATA0<S0C0>
extern volatile __bit                   S0C0                __at(0x880);	// @ (0x110 * 8 + 0)
#define                                 S0C0_bit            _BIT_ACCESS(LCDDATA0,0)
// LCDDATA3<S0C1>
extern volatile __bit                   S0C1                __at(0x898);	// @ (0x113 * 8 + 0)
#define                                 S0C1_bit            _BIT_ACCESS(LCDDATA3,0)
// LCDDATA6<S0C2>
extern volatile __bit                   S0C2                __at(0x8B0);	// @ (0x116 * 8 + 0)
#define                                 S0C2_bit            _BIT_ACCESS(LCDDATA6,0)
// LCDDATA9<S0C3>
extern volatile __bit                   S0C3                __at(0x8C8);	// @ (0x119 * 8 + 0)
#define                                 S0C3_bit            _BIT_ACCESS(LCDDATA9,0)
// LCDDATA1<S10C0>
extern volatile __bit                   S10C0               __at(0x88A);	// @ (0x111 * 8 + 2)
#define                                 S10C0_bit           _BIT_ACCESS(LCDDATA1,2)
// LCDDATA4<S10C1>
extern volatile __bit                   S10C1               __at(0x8A2);	// @ (0x114 * 8 + 2)
#define                                 S10C1_bit           _BIT_ACCESS(LCDDATA4,2)
// LCDDATA7<S10C2>
extern volatile __bit                   S10C2               __at(0x8BA);	// @ (0x117 * 8 + 2)
#define                                 S10C2_bit           _BIT_ACCESS(LCDDATA7,2)
// LCDDATA10<S10C3>
extern volatile __bit                   S10C3               __at(0x8D2);	// @ (0x11A * 8 + 2)
#define                                 S10C3_bit           _BIT_ACCESS(LCDDATA10,2)
// LCDDATA1<S11C0>
extern volatile __bit                   S11C0               __at(0x88B);	// @ (0x111 * 8 + 3)
#define                                 S11C0_bit           _BIT_ACCESS(LCDDATA1,3)
// LCDDATA4<S11C1>
extern volatile __bit                   S11C1               __at(0x8A3);	// @ (0x114 * 8 + 3)
#define                                 S11C1_bit           _BIT_ACCESS(LCDDATA4,3)
// LCDDATA7<S11C2>
extern volatile __bit                   S11C2               __at(0x8BB);	// @ (0x117 * 8 + 3)
#define                                 S11C2_bit           _BIT_ACCESS(LCDDATA7,3)
// LCDDATA10<S11C3>
extern volatile __bit                   S11C3               __at(0x8D3);	// @ (0x11A * 8 + 3)
#define                                 S11C3_bit           _BIT_ACCESS(LCDDATA10,3)
// LCDDATA1<S12C0>
extern volatile __bit                   S12C0               __at(0x88C);	// @ (0x111 * 8 + 4)
#define                                 S12C0_bit           _BIT_ACCESS(LCDDATA1,4)
// LCDDATA4<S12C1>
extern volatile __bit                   S12C1               __at(0x8A4);	// @ (0x114 * 8 + 4)
#define                                 S12C1_bit           _BIT_ACCESS(LCDDATA4,4)
// LCDDATA7<S12C2>
extern volatile __bit                   S12C2               __at(0x8BC);	// @ (0x117 * 8 + 4)
#define                                 S12C2_bit           _BIT_ACCESS(LCDDATA7,4)
// LCDDATA10<S12C3>
extern volatile __bit                   S12C3               __at(0x8D4);	// @ (0x11A * 8 + 4)
#define                                 S12C3_bit           _BIT_ACCESS(LCDDATA10,4)
// LCDDATA1<S13C0>
extern volatile __bit                   S13C0               __at(0x88D);	// @ (0x111 * 8 + 5)
#define                                 S13C0_bit           _BIT_ACCESS(LCDDATA1,5)
// LCDDATA4<S13C1>
extern volatile __bit                   S13C1               __at(0x8A5);	// @ (0x114 * 8 + 5)
#define                                 S13C1_bit           _BIT_ACCESS(LCDDATA4,5)
// LCDDATA7<S13C2>
extern volatile __bit                   S13C2               __at(0x8BD);	// @ (0x117 * 8 + 5)
#define                                 S13C2_bit           _BIT_ACCESS(LCDDATA7,5)
// LCDDATA10<S13C3>
extern volatile __bit                   S13C3               __at(0x8D5);	// @ (0x11A * 8 + 5)
#define                                 S13C3_bit           _BIT_ACCESS(LCDDATA10,5)
// LCDDATA1<S14C0>
extern volatile __bit                   S14C0               __at(0x88E);	// @ (0x111 * 8 + 6)
#define                                 S14C0_bit           _BIT_ACCESS(LCDDATA1,6)
// LCDDATA4<S14C1>
extern volatile __bit                   S14C1               __at(0x8A6);	// @ (0x114 * 8 + 6)
#define                                 S14C1_bit           _BIT_ACCESS(LCDDATA4,6)
// LCDDATA7<S14C2>
extern volatile __bit                   S14C2               __at(0x8BE);	// @ (0x117 * 8 + 6)
#define                                 S14C2_bit           _BIT_ACCESS(LCDDATA7,6)
// LCDDATA10<S14C3>
extern volatile __bit                   S14C3               __at(0x8D6);	// @ (0x11A * 8 + 6)
#define                                 S14C3_bit           _BIT_ACCESS(LCDDATA10,6)
// LCDDATA1<S15C0>
extern volatile __bit                   S15C0               __at(0x88F);	// @ (0x111 * 8 + 7)
#define                                 S15C0_bit           _BIT_ACCESS(LCDDATA1,7)
// LCDDATA4<S15C1>
extern volatile __bit                   S15C1               __at(0x8A7);	// @ (0x114 * 8 + 7)
#define                                 S15C1_bit           _BIT_ACCESS(LCDDATA4,7)
// LCDDATA7<S15C2>
extern volatile __bit                   S15C2               __at(0x8BF);	// @ (0x117 * 8 + 7)
#define                                 S15C2_bit           _BIT_ACCESS(LCDDATA7,7)
// LCDDATA10<S15C3>
extern volatile __bit                   S15C3               __at(0x8D7);	// @ (0x11A * 8 + 7)
#define                                 S15C3_bit           _BIT_ACCESS(LCDDATA10,7)
// LCDDATA0<S1C0>
extern volatile __bit                   S1C0                __at(0x881);	// @ (0x110 * 8 + 1)
#define                                 S1C0_bit            _BIT_ACCESS(LCDDATA0,1)
// LCDDATA3<S1C1>
extern volatile __bit                   S1C1                __at(0x899);	// @ (0x113 * 8 + 1)
#define                                 S1C1_bit            _BIT_ACCESS(LCDDATA3,1)
// LCDDATA6<S1C2>
extern volatile __bit                   S1C2                __at(0x8B1);	// @ (0x116 * 8 + 1)
#define                                 S1C2_bit            _BIT_ACCESS(LCDDATA6,1)
// LCDDATA9<S1C3>
extern volatile __bit                   S1C3                __at(0x8C9);	// @ (0x119 * 8 + 1)
#define                                 S1C3_bit            _BIT_ACCESS(LCDDATA9,1)
// LCDDATA0<S2C0>
extern volatile __bit                   S2C0                __at(0x882);	// @ (0x110 * 8 + 2)
#define                                 S2C0_bit            _BIT_ACCESS(LCDDATA0,2)
// LCDDATA3<S2C1>
extern volatile __bit                   S2C1                __at(0x89A);	// @ (0x113 * 8 + 2)
#define                                 S2C1_bit            _BIT_ACCESS(LCDDATA3,2)
// LCDDATA6<S2C2>
extern volatile __bit                   S2C2                __at(0x8B2);	// @ (0x116 * 8 + 2)
#define                                 S2C2_bit            _BIT_ACCESS(LCDDATA6,2)
// LCDDATA9<S2C3>
extern volatile __bit                   S2C3                __at(0x8CA);	// @ (0x119 * 8 + 2)
#define                                 S2C3_bit            _BIT_ACCESS(LCDDATA9,2)
// LCDDATA0<S3C0>
extern volatile __bit                   S3C0                __at(0x883);	// @ (0x110 * 8 + 3)
#define                                 S3C0_bit            _BIT_ACCESS(LCDDATA0,3)
// LCDDATA3<S3C1>
extern volatile __bit                   S3C1                __at(0x89B);	// @ (0x113 * 8 + 3)
#define                                 S3C1_bit            _BIT_ACCESS(LCDDATA3,3)
// LCDDATA6<S3C2>
extern volatile __bit                   S3C2                __at(0x8B3);	// @ (0x116 * 8 + 3)
#define                                 S3C2_bit            _BIT_ACCESS(LCDDATA6,3)
// LCDDATA9<S3C3>
extern volatile __bit                   S3C3                __at(0x8CB);	// @ (0x119 * 8 + 3)
#define                                 S3C3_bit            _BIT_ACCESS(LCDDATA9,3)
// LCDDATA0<S4C0>
extern volatile __bit                   S4C0                __at(0x884);	// @ (0x110 * 8 + 4)
#define                                 S4C0_bit            _BIT_ACCESS(LCDDATA0,4)
// LCDDATA3<S4C1>
extern volatile __bit                   S4C1                __at(0x89C);	// @ (0x113 * 8 + 4)
#define                                 S4C1_bit            _BIT_ACCESS(LCDDATA3,4)
// LCDDATA6<S4C2>
extern volatile __bit                   S4C2                __at(0x8B4);	// @ (0x116 * 8 + 4)
#define                                 S4C2_bit            _BIT_ACCESS(LCDDATA6,4)
// LCDDATA9<S4C3>
extern volatile __bit                   S4C3                __at(0x8CC);	// @ (0x119 * 8 + 4)
#define                                 S4C3_bit            _BIT_ACCESS(LCDDATA9,4)
// LCDDATA0<S5C0>
extern volatile __bit                   S5C0                __at(0x885);	// @ (0x110 * 8 + 5)
#define                                 S5C0_bit            _BIT_ACCESS(LCDDATA0,5)
// LCDDATA3<S5C1>
extern volatile __bit                   S5C1                __at(0x89D);	// @ (0x113 * 8 + 5)
#define                                 S5C1_bit            _BIT_ACCESS(LCDDATA3,5)
// LCDDATA6<S5C2>
extern volatile __bit                   S5C2                __at(0x8B5);	// @ (0x116 * 8 + 5)
#define                                 S5C2_bit            _BIT_ACCESS(LCDDATA6,5)
// LCDDATA9<S5C3>
extern volatile __bit                   S5C3                __at(0x8CD);	// @ (0x119 * 8 + 5)
#define                                 S5C3_bit            _BIT_ACCESS(LCDDATA9,5)
// LCDDATA0<S6C0>
extern volatile __bit                   S6C0                __at(0x886);	// @ (0x110 * 8 + 6)
#define                                 S6C0_bit            _BIT_ACCESS(LCDDATA0,6)
// LCDDATA3<S6C1>
extern volatile __bit                   S6C1                __at(0x89E);	// @ (0x113 * 8 + 6)
#define                                 S6C1_bit            _BIT_ACCESS(LCDDATA3,6)
// LCDDATA6<S6C2>
extern volatile __bit                   S6C2                __at(0x8B6);	// @ (0x116 * 8 + 6)
#define                                 S6C2_bit            _BIT_ACCESS(LCDDATA6,6)
// LCDDATA9<S6C3>
extern volatile __bit                   S6C3                __at(0x8CE);	// @ (0x119 * 8 + 6)
#define                                 S6C3_bit            _BIT_ACCESS(LCDDATA9,6)
// LCDDATA0<S7C0>
extern volatile __bit                   S7C0                __at(0x887);	// @ (0x110 * 8 + 7)
#define                                 S7C0_bit            _BIT_ACCESS(LCDDATA0,7)
// LCDDATA3<S7C1>
extern volatile __bit                   S7C1                __at(0x89F);	// @ (0x113 * 8 + 7)
#define                                 S7C1_bit            _BIT_ACCESS(LCDDATA3,7)
// LCDDATA6<S7C2>
extern volatile __bit                   S7C2                __at(0x8B7);	// @ (0x116 * 8 + 7)
#define                                 S7C2_bit            _BIT_ACCESS(LCDDATA6,7)
// LCDDATA9<S7C3>
extern volatile __bit                   S7C3                __at(0x8CF);	// @ (0x119 * 8 + 7)
#define                                 S7C3_bit            _BIT_ACCESS(LCDDATA9,7)
// LCDDATA1<S8C0>
extern volatile __bit                   S8C0                __at(0x888);	// @ (0x111 * 8 + 0)
#define                                 S8C0_bit            _BIT_ACCESS(LCDDATA1,0)
// LCDDATA4<S8C1>
extern volatile __bit                   S8C1                __at(0x8A0);	// @ (0x114 * 8 + 0)
#define                                 S8C1_bit            _BIT_ACCESS(LCDDATA4,0)
// LCDDATA7<S8C2>
extern volatile __bit                   S8C2                __at(0x8B8);	// @ (0x117 * 8 + 0)
#define                                 S8C2_bit            _BIT_ACCESS(LCDDATA7,0)
// LCDDATA10<S8C3>
extern volatile __bit                   S8C3                __at(0x8D0);	// @ (0x11A * 8 + 0)
#define                                 S8C3_bit            _BIT_ACCESS(LCDDATA10,0)
// LCDDATA1<S9C0>
extern volatile __bit                   S9C0                __at(0x889);	// @ (0x111 * 8 + 1)
#define                                 S9C0_bit            _BIT_ACCESS(LCDDATA1,1)
// LCDDATA4<S9C1>
extern volatile __bit                   S9C1                __at(0x8A1);	// @ (0x114 * 8 + 1)
#define                                 S9C1_bit            _BIT_ACCESS(LCDDATA4,1)
// LCDDATA7<S9C2>
extern volatile __bit                   S9C2                __at(0x8B9);	// @ (0x117 * 8 + 1)
#define                                 S9C2_bit            _BIT_ACCESS(LCDDATA7,1)
// LCDDATA10<S9C3>
extern volatile __bit                   S9C3                __at(0x8D1);	// @ (0x11A * 8 + 1)
#define                                 S9C3_bit            _BIT_ACCESS(LCDDATA10,1)
// PCON<SBOREN>
extern volatile __bit                   SBOREN              __at(0x474);	// @ (0x8E * 8 + 4)
#define                                 SBOREN_bit          _BIT_ACCESS(PCON,4)
// OSCCON<SCS>
extern volatile __bit                   SCS                 __at(0x478);	// @ (0x8F * 8 + 0)
#define                                 SCS_bit             _BIT_ACCESS(OSCCON,0)
// LCDSE0<SE0>
extern volatile __bit                   SE0                 __at(0x8E0);	// @ (0x11C * 8 + 0)
#define                                 SE0_bit             _BIT_ACCESS(LCDSE0,0)
// LCDSE0<SE1>
extern volatile __bit                   SE1                 __at(0x8E1);	// @ (0x11C * 8 + 1)
#define                                 SE1_bit             _BIT_ACCESS(LCDSE0,1)
// LCDSE1<SE10>
